# CannotLoadLink Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DocumentFailures..::..CannotLoadLink Property
BuiltInFailures..::..DocumentFailures Class See Also
---
Can't load Linked File [Name] due to errors. Open it separately to investigate the problem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotLoadLink { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotLoadLink As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotLoadLink {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DocumentFailures Class
Autodesk.Revit.DB Namespace